app/controllers/garvin_folders_controller.rb

SELECT * FROM "garvin_folders" WHERE ("garvin_folders".parent_garvin_folder = 2)
SELECT * FROM "garvin_docs" WHERE ("garvin_docs".garvin_folder_id = 2)
---
  def index
    @parent = current_user.root_folder
    @folder = @parent.garvin_folder.find(:all)
    @doc = @parent.garvin_doc.find(:all)

SELECT * FROM "garvin_folders" WHERE ("garvin_folders".parent_garvin_folder = 17)
SELECT * FROM "garvin_docs" WHERE ("garvin_docs".garvin_folder_id = 17)
---
  def show
    @parent = GarvinFolder.find(params[:id])
    @folder = @parent.garvin_folder.find(:all)
    @doc = @parent.garvin_doc.find(:all)

SELECT * FROM "garvin_folders" WHERE ("garvin_folders"."id" = 2)
INSERT INTO "garvin_folders" ("name", "created_at", "updated_at", "parent_garvin_folder") VALUES('Awesome Folder', '2010-05-02 22:33:34', '2010-05-02 22:33:34', NULL)
---
  def create
		@folder = GarvinFolder.new(params[:garvin_folder])
    @folder.parent_garvin_folder = GarvinFolder.find(params[:parent])
    @folder.save!