app/controllers/garvin_folder_controller.rb

SELECT * FROM "garvin_folders" WHERE ("garvin_folders".parent_garvin_folder = 1)
SELECT * FROM "garvin_docs" WHERE ("garvin_docs".garvin_folder_id = 1)
---
  def index
    @parent=current_user.root_folder
    @folder=@parent.garvin_folder.find(:all)
    @doc=@parent.garvin_doc.find(:all)

SELECT * FROM "garvin_folders" WHERE ("garvin_folders".parent_garvin_folder = 1)
SELECT * FROM "garvin_docs" WHERE ("garvin_docs".garvin_folder_id = 1)
---
  def show
    @parent=GarvinFolder.find(params[:id])
    @folder=@parent.garvin_folder.find(:all)
    @doc=@parent.garvin_doc.find(:all)