app/controllers/garvin_doc_controller.rb

  def new
    @parent = GarvinFolder.find(params[:id])
---
SELECT * FROM "garvin_folders" WHERE ("garvin_folders"."id" = 2)

  def edit
    @doc = GarvinDoc.find(params[:id])
---
SELECT * FROM "garvin_docs" WHERE ("garvin_docs"."id" = 1)

  def delete
    @doc = GarvinDoc.find(params[:id])
    @doc.destroy
---
SELECT * FROM "garvin_docs" WHERE ("garvin_docs"."id" = 1)
DELETE FROM "garvin_docs" WHERE "id" = 1

  def create
    @parent = GarvinFolder.find(params[:parent][:id])
    @doc = GarvinDoc.new(params[:doc])
    @doc.garvin_folder = @parent
    @doc.save
---
SELECT * FROM "garvin_folders" WHERE ("garvin_folders"."id" = 2)
INSERT INTO "garvin_docs" ("created_at", "title", "body", "updated_at", "garvin_folder_id") VALUES('2010-02-25 23:53:20', 'Test Doc in Folder Placement 2', 'This is to see that the document is not placed in the root.<br><input id="parent_id" name="parent[id]" value="1" type="hidden">

  def update
    @doc = GarvinDoc.find(params[:id])
    @doc.title = params[:doc][:title]
    @doc.body = params[:doc][:body]
    if @doc.save!
---
SELECT * FROM "garvin_docs" WHERE ("garvin_docs"."id" = 4)
UPDATE "garvin_docs" SET "updated_at" = '2010-05-18 15:04:22', "body" = '<font face="Courier">Hello</font> <font face="Arial"><font face="Times New Roman">ddddddd</font>dd ddNurse</font><br><input id="parent_id" name="parent[id]" value="2" type="hidden">

  def print
  	@doc = GarvinDoc.find(params[:id])
---
SELECT * FROM "garvin_docs" WHERE ("garvin_docs"."id" = 5)