app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @root = GarvinFolder.new
    @root.name = @user.login + "_root"
    @root.save
    @user.root_folder = @root
    @user.save
    if @user.errors.empty?
---
INSERT INTO "garvin_folders" ("name", "created_at", "updated_at", "parent_garvin_folder", "garvin_folder_id") VALUES('test_users_root folder', '2010-02-24 08:35:01', '2010-02-24 08:35:01', NULL, NULL)
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "root_folder", "updated_at", "remember_token", "login", "email") VALUES('a424d7797c4172e9ee5f2de091e2e2177e6606e9', '2010-02-24 08:32:35', 'f837a0bc974fd951fafc103d42a71f3ad5812b23', NULL, NULL, '2010-02-24 08:32:35', NULL, 'test_user', 'test_user@gmail.com')
SELECT "users".id FROM "users" WHERE (LOWER("users"."login") = 'odin') LIMIT 1